src/cf/src/Documents/ТехнологическаяКарта/ТехнологическаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехнологическаяКарта</name>
  <registerRecords>InformationRegister.СоставТехКарты</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзготовления</name>
      <type>
        <types>EnumRef.СпособыИзготовления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/СоставТехКарты/СоставТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставТехКарты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.НормаРасхода</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>СпособИзготовления</name>
    <type>
      <types>EnumRef.СпособыИзготовления</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентПотерь</name>
    <type>
      <types>DefinedType.Процент</types>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ТехнологическаяКарта/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Дата = ТекущаяДатаСеанса();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Тот же порядок блокировок, что у фасада и проведения заказа на производство: сначала карты продукции,
	// потом документ карты - иначе запись из формы карты и проведение заказа ждали бы друг друга.
	// При смене продукции у записанной карты записи прежней продукции тоже удаляются - блокируются обе.
	Продукция = Новый Массив;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Продукция.Добавить(Номенклатура);
	КонецЕсли;
	Если Не ЭтоНовый() Тогда
		ПрежняяПродукция = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Номенклатура");
		Если ЗначениеЗаполнено(ПрежняяПродукция) И Продукция.Найти(ПрежняяПродукция) = Неопределено Тогда
			Продукция.Добавить(ПрежняяПродукция);
		КонецЕсли;
	КонецЕсли;
	Если Продукция.Количество() > 0 Тогда
		ТехнологическиеКарты.ЗаблокироватьКартыПродукции(Продукция);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Если ТЧМатериалы.Количество() = 0 Тогда
		// Пустой состав - законное состояние: карта отменена. Одна маркерная запись с пустым
		// материалом и нулём отменяет прежнюю версию, а отсутствие движений вернуло бы чтение
		// к предыдущему документу.
		НоваяЗапись = Движения.СоставТехКарты.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Продукция = Номенклатура;
		НоваяЗапись.Количество = 0;
		Движения.Записать();
		Возврат;
	КонецЕсли;
	Для Каждого Стр Из СвёрнутыйСостав() Цикл
		НоваяЗапись = Движения.СоставТехКарты.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Продукция = Номенклатура;
		НоваяЗапись.Материал = Стр.Номенклатура;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр, "Характеристика, Упаковка, Количество");
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Пустая ТЧМатериалы - законное состояние (отмена карты), строк не требуем.
	Для Каждого Стр Из ТЧМатериалы Цикл
		Если ЗначениеЗаполнено(Номенклатура) И Стр.Номенклатура = Номенклатура Тогда
			ТекстОшибки = НСтр("ru = 'Материал совпадает с продукцией: карта включает саму себя';
				|fr = 'La matière coïncide avec le produit : la gamme se contient elle-même';
				|en = 'The material matches the product: the routing includes itself';
				|es = 'El material coincide con el producto: la ruta se incluye a sí misma'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,
				"ТЧМатериалы[" + Формат(Стр.НомерСтроки - 1, "ЧГ=0") + "].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Состав карты, приведённый к измерениям регистра.
// Измерения регистра - продукция, материал и характеристика: две строки с одним материалом
// и одной характеристикой дали бы дубль ключа и падение записи движений. Количество таких
// строк суммируется, упаковка остаётся от первой строки - разные упаковки одного материала
// регистр не различает.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Упаковка, Количество.
//
Функция СвёрнутыйСостав()
	ТЗ = ТЧМатериалы.Выгрузить(, "Номенклатура, Характеристика, Упаковка, Количество");
	ТЗ.Свернуть("Номенклатура, Характеристика, Упаковка", "Количество");
	Результат = ТЗ.СкопироватьКолонки();
	Для Каждого Стр Из ТЗ Цикл
		Отбор = Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика);
		Найденные = Результат.НайтиСтроки(Отбор);
		Если Найденные.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Стр);
		Иначе
			Найденные[0].Количество = Найденные[0].Количество + Стр.Количество;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти
